
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group_rule.sgrule_main_ipv4 must be replaced
-/+ resource "aws_security_group_rule" "sgrule_main_ipv4" {
      ~ cidr_blocks              = [ # forces replacement
          ~ "62.36.0.153/32" -> "95.127.52.150/32",
        ]
      ~ id                       = "sgrule-2083101761" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0bfd75b9194047485" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
